src/main/resources/test/requestGetCountryByName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryByNameRequest>
         <gs:name>Poland</gs:name>
      </gs:getCountryByNameRequest>
   </soapenv:Body>
</soapenv:Envelope>